OpenFOAM/ERCOFTAC-SIG15/case13.1/alpha_4.1/system/functionAverage
    Average
    {
        type            volRegion;
        libs ("libfieldFunctionObjects.so");
        enabled         true;
	writeControl    timeStep;
	writeInterval   1;
        log             true;
        writeFields     false;
        regionType      all;
        name            all;
        operation       volAverage;

        fields
        (
            U
            p
	    k
	    epsilon
	    omega
        );
    }
